InformationRegisters/СведенияОбАккредитацияхСпециалистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбАккредитацияхСпециалистов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПроцедуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПроцедурАккредитацииСпециалистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрофессиональныйСтандарт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофессиональныеСтандарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоПроведения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерСвидетельства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияСвидетельства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиСвидетельства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньОбразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальностьПоОбразованию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельностиСпециалистов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПротокола</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/АккредитацияСпециалистов/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ТекущиеДела

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриЗаполненииСпискаТекущихДел_ДобавитьДело(ТекущиеДела, Знач МенеджерВременныхТаблиц, НачалоПериода, КонецПериода) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьАккредитациюСпециалистов") Тогда
		Возврат;
	КонецЕсли;

	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СведенияОбАккредитацияхСпециалистов) Тогда
		Возврат;
	КонецЕсли;
	
	Раздел = НСтр("ru = 'Аттестации и квалификационные экзамены'");
	Представление  = НСтр("ru = 'Аккредитация специалистов'");
	Подсказка      = НСтр("ru = 'Истекают сроки действия аккредитации специалистов.'");
	
	ПериодОтчета = Новый СтандартныйПериод(НачалоПериода, КонецПериода);

	ДелоЗаголовок = ТекущиеДела.Добавить();
	ДелоЗаголовок.Идентификатор = "СведенияОбАккредитацияхСпециалистов";
	ДелоЗаголовок.Важное        = Ложь;
	ДелоЗаголовок.Владелец      = Раздел;
	ДелоЗаголовок.Представление = Представление;
	ДелоЗаголовок.Подсказка     = Представление;
	ДелоЗаголовок.ЕстьДела      = Ложь;
	ДелоЗаголовок.Форма         = "Отчет.АккредитацииСпециалистов.Форма";
	ПараметрыЗаголовка  = Новый Структура;
	ПараметрыЗаголовка.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыЗаголовка.Вставить("КлючВарианта", "СотрудникиБезАккредитации");
	ПользовательскиеНастройкиОтчета = КадровыйУчетРасширенный.ПользовательскиеНастройкиОтчетаПоСотрудникам(
		"АккредитацииСпециалистов",
		"СотрудникиБезАккредитации",
		Новый Структура);
	ПараметрыЗаголовка.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройкиОтчета);
	
	Раздел                      = ДелоЗаголовок.Идентификатор;
	
	МодульТекущиеДелаСервер = ОбщегоНазначения.ОбщийМодуль("ТекущиеДелаСервер");
	Если МодульТекущиеДелаСервер.ДелоОтключено(Раздел) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТСотрудникиОрганизации.ОрганизацияФункциональныхОпций КАК Организация,
	|	ВТСотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОбАккредитацияхСпециалистов.Специальность КАК Специальность,
	|	МАКСИМУМ(СведенияОбАккредитацияхСпециалистов.ДействуетДо) КАК ДействуетДо
	|ИЗ
	|	ВТСотрудникиОрганизации КАК ВТСотрудникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбАккредитацияхСпециалистов КАК СведенияОбАккредитацияхСпециалистов
	|		ПО (СведенияОбАккредитацияхСпециалистов.ФизическоеЛицо = ВТСотрудникиОрганизации.ФизическоеЛицо)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСотрудникиОрганизации.ОрганизацияФункциональныхОпций,
	|	ВТСотрудникиОрганизации.ФизическоеЛицо,
	|	СведенияОбАккредитацияхСпециалистов.Специальность
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(СведенияОбАккредитацияхСпециалистов.ДействуетДо) МЕЖДУ &НачалоПериода И &КонецПериода
	|ИТОГИ ПО
	|	Организация,
	|	ФизическоеЛицо";
	
	РезультатЗапроса = Запрос.Выполнить();

	ДанныеОрганизаций = Новый Соответствие;
	ФизическиеЛицаОбщий = Новый Массив;
	
	ВыборкаОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизация.Следующий() Цикл
		Организация = ВыборкаОрганизация.Организация;
		ФизическиеЛица = Новый Массив;
		ВыборкаФизическиеЛица = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаФизическиеЛица.Следующий() Цикл
			ФизическиеЛица.Добавить(ВыборкаФизическиеЛица.ФизическоеЛицо);
			ФизическиеЛицаОбщий.Добавить(ВыборкаФизическиеЛица.ФизическоеЛицо);
		КонецЦикла;
		ДанныеОрганизаций.Вставить(Организация, ФизическиеЛица);
	КонецЦикла;
		
	Для Каждого КлючИЗначение Из ДанныеОрганизаций Цикл 
		
		Организация = КлючИЗначение.Ключ;
		ФизическиеЛица = КлючИЗначение.Значение;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор = "СведенияОбАккредитацияхСпециалистов" + СтрЗаменить(Организация.УникальныйИдентификатор(), "-", "");
		Дело.Важное        = Истина;
		Дело.Владелец      = Раздел;
		Дело.Представление = Представление + ", " + Строка(Организация);
		Дело.Подсказка     = Подсказка;
		Дело.Форма         = "Отчет.АккредитацииСпециалистов.Форма";
		Дело.ЕстьДела      = Истина;
		Дело.Количество    = ФизическиеЛица.Количество();
		
		ПараметрыФормы  = Новый Структура;
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Период", ПериодОтчета);
		СтруктураОтбора.Вставить("Организация", Организация);
		СтруктураОтбора.Вставить("ФизическоеЛицо", ФизическиеЛица);
		СтруктураОтбора.Вставить("ТолькоДолжностиМедицинскихРаботников", Ложь);
		
		ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("КлючВарианта", "СотрудникиБезАккредитации");
		
		Дело.ПараметрыФормы = ПараметрыФормы;
		
		ДелоЗаголовок.ЕстьДела = Истина;
		
	КонецЦикла;
	ПараметрыЗаголовка.Вставить("Отбор", Новый Структура("Период, ФизическоеЛицо, ТолькоДолжностиМедицинскихРаботников", ПериодОтчета, ФизическиеЛицаОбщий, Ложь));
	ДелоЗаголовок.ПараметрыФормы = ПараметрыЗаголовка;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "bc98f61b-f15e-4c99-85c2-f84bfb3f8910", Метаданные.Справочники.ВидыДеятельностиСпециалистов);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "4649c663-c7bb-4711-a128-2c777ba5ce95", Метаданные.Справочники.ВидыПроцедурАккредитацииСпециалистов);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c8062b8f-6742-4931-a8cb-784d2eb190ef", Метаданные.Справочники.ПрофессиональныеСтандарты);
	
КонецПроцедуры

#КонецОбласти

Процедура ПриСозданииНаСервереФормыОбразованиеКвалификация(Форма, РодительскаяГруппа, ГруппаПередКоторойДобавить) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьАккредитациюСпециалистов") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("ФизическоеЛицоАккредитацииТекст", Новый ОписаниеТипов("Строка"));
	НовыйРеквизит.Заголовок = НСтр("ru = 'Аккредитации'");
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
		
	Если Форма.Команды.Найти("ФизическоеЛицоАккредитацииИзменить") = Неопределено Тогда
		НоваяКоманда = Форма.Команды.Добавить("ФизическоеЛицоАккредитацииИзменить");
		НоваяКоманда.Действие = "Подключаемый_ФизическоеЛицоАккредитацииИзменить";
		НоваяКоманда.Заголовок = НСтр("ru = 'Изменить'");
	КонецЕсли;
	
	ГруппаАккредитации = Форма.Элементы.Найти("ГруппаФизическоеЛицоАккредитацииСпециалиста");
	Если ГруппаАккредитации = Неопределено Тогда

		ГруппаАккредитации = Форма.Элементы.Вставить("ГруппаФизическоеЛицоАккредитацииСпециалиста", Тип("ГруппаФормы"), 
			РодительскаяГруппа, ГруппаПередКоторойДобавить);
		ГруппаАккредитации.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаАккредитации.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		ГруппаАккредитации.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаАккредитации.ОтображатьЗаголовок = Ложь;
		ГруппаАккредитации.РазрешитьИзменениеСостава = Ложь;
		
		ЭлементНадпись = Форма.Элементы.Вставить("ФизическоеЛицоАккредитацииТекст", Тип("ПолеФормы"), ГруппаАккредитации);
		ЭлементНадпись.ПутьКДанным = "ФизическоеЛицоАккредитацииТекст";
		ЭлементНадпись.Вид = ВидПоляФормы.ПолеНадписи;
		ЭлементНадпись.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		ЭлементНадпись.Высота = 2;
		ЭлементНадпись.РастягиватьПоВертикали = Ложь;
		
		ЭлементКнопка = Форма.Элементы.Вставить("ФизическоеЛицоАккредитацииТекстИзменить", Тип("КнопкаФормы"), ГруппаАккредитации);
		ЭлементКнопка.Вид = ВидКнопкиФормы.Гиперссылка;
		ЭлементКнопка.ИмяКоманды = "ФизическоеЛицоАккредитацииИзменить"; 
		
	КонецЕсли;
	
	Форма.ФизическоеЛицоАккредитацииТекст = 
			РегистрыСведений.СведенияОбАккредитацияхСпециалистов.ПредставлениеАккредитацийСпециалиста(Форма.ФизическоеЛицоСсылка);
		
КонецПроцедуры

#КонецОбласти
